hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_mce.h
#define	MCE_EADDR1_BADDEND			(0xFFFFFu<<12)
#define	MCE_EADDR1_BADDEND_0		(0x1u<<12)

// REGCR2 Configuration

#define	MCE_REGCR2_ENC				(0x3u<<14)
#define	MCE_REGCR2_ENC_0			(0x1u<<14)
#define	MCE_REGCR2_CTXID			(0x3u<<9)
#define	MCE_REGCR2_CTXID_0			(0x1u<<9)
#define	MCE_REGCR2_BREN				(0x1u<<0)

#define	MCE_REGCR2_ENC_B_0X0		(0x0u<<14)
#define	MCE_REGCR2_ENC_B_0X1		(0x1u<<14)
#define	MCE_REGCR2_ENC_B_0X2		(0x2u<<14)
#define	MCE_REGCR2_ENC_B_0X3		(0x3u<<14)
#define	MCE_REGCR2_CTXID_B_0X0		(0x0u<<9)
#define	MCE_REGCR2_CTXID_B_0X1		(0x1u<<9)
#define	MCE_REGCR2_CTXID_B_0X2		(0x2u<<9)
#define	MCE_REGCR2_BREN_B_0X0		(0x0u<<0)
#define	MCE_REGCR2_BREN_B_0X1		(0x1u<<0)

// SADDR2 Configuration

#define	MCE_SADDR2_BADDSTART		(0xFFFFFu<<12)
#define	MCE_SADDR2_BADDSTART_0		(0x1u<<12)

// EADDR2 Configuration

#define	MCE_EADDR2_BADDEND			(0xFFFFFu<<12)
#define	MCE_EADDR2_BADDEND_0		(0x1u<<12)

// REGCR3 Configuration

#define	MCE_REGCR3_ENC				(0x3u<<14)
#define	MCE_REGCR3_ENC_0			(0x1u<<14)
#define	MCE_REGCR3_CTXID			(0x3u<<9)
#define	MCE_REGCR3_CTXID_0			(0x1u<<9)
#define	MCE_REGCR3_BREN				(0x1u<<0)

#define	MCE_REGCR3_ENC_B_0X0		(0x0u<<14)
#define	MCE_REGCR3_ENC_B_0X1		(0x1u<<14)
#define	MCE_REGCR3_ENC_B_0X2		(0x2u<<14)
#define	MCE_REGCR3_ENC_B_0X3		(0x3u<<14)
#define	MCE_REGCR3_CTXID_B_0X0		(0x0u<<9)
#define	MCE_REGCR3_CTXID_B_0X1		(0x1u<<9)
#define	MCE_REGCR3_CTXID_B_0X2		(0x2u<<9)
#define	MCE_REGCR3_BREN_B_0X0		(0x0u<<0)
#define	MCE_REGCR3_BREN_B_0X1		(0x1u<<0)

// SADDR3 Configuration

#define	MCE_SADDR3_BADDSTART		(0xFFFFFu<<12)
#define	MCE_SADDR3_BADDSTART_0		(0x1u<<12)

// EADDR3 Configuration

#define	MCE_EADDR3_BADDEND			(0xFFFFFu<<12)
#define	MCE_EADDR3_BADDEND_0		(0x1u<<12)

// REGCR4 Configuration

#define	MCE_REGCR4_ENC				(0x3u<<14)
#define	MCE_REGCR4_ENC_0			(0x1u<<14)
#define	MCE_REGCR4_CTXID			(0x3u<<9)
#define	MCE_REGCR4_CTXID_0			(0x1u<<9)
#define	MCE_REGCR4_BREN				(0x1u<<0)

#define	MCE_REGCR4_ENC_B_0X0		(0x0u<<14)
#define	MCE_REGCR4_ENC_B_0X1		(0x1u<<14)
#define	MCE_REGCR4_ENC_B_0X2		(0x2u<<14)
#define	MCE_REGCR4_ENC_B_0X3		(0x3u<<14)
#define	MCE_REGCR4_CTXID_B_0X0		(0x0u<<9)
#define	MCE_REGCR4_CTXID_B_0X1		(0x1u<<9)
#define	MCE_REGCR4_CTXID_B_0X2		(0x2u<<9)
#define	MCE_REGCR4_BREN_B_0X0		(0x0u<<0)
#define	MCE_REGCR4_BREN_B_0X1		(0x1u<<0)

// SADDR4 Configuration

#define	MCE_SADDR4_BADDSTART		(0xFFFFFu<<12)
#define	MCE_SADDR4_BADDSTART_0		(0x1u<<12)

// EADDR4 Configuration

#define	MCE_EADDR4_BADDEND			(0xFFFFFu<<12)
#define	MCE_EADDR4_BADDEND_0		(0x1u<<12)

// MKEYR0 Configuration

#define	MCE_MKEYR0_MKEY31			(0x1u<<31)
#define	MCE_MKEYR0_MKEY30			(0x1u<<30)
#define	MCE_MKEYR0_MKEY29			(0x1u<<29)
#define	MCE_MKEYR0_MKEY28			(0x1u<<28)
#define	MCE_MKEYR0_MKEY27			(0x1u<<27)
#define	MCE_MKEYR0_MKEY26			(0x1u<<26)
#define	MCE_MKEYR0_MKEY25			(0x1u<<25)
#define	MCE_MKEYR0_MKEY24			(0x1u<<24)
#define	MCE_MKEYR0_MKEY23			(0x1u<<23)
#define	MCE_MKEYR0_MKEY22			(0x1u<<22)
#define	MCE_MKEYR0_MKEY21			(0x1u<<21)
#define	MCE_MKEYR0_MKEY20			(0x1u<<20)
#define	MCE_MKEYR0_MKEY19			(0x1u<<19)
#define	MCE_MKEYR0_MKEY18			(0x1u<<18)
#define	MCE_MKEYR0_MKEY17			(0x1u<<17)
#define	MCE_MKEYR0_MKEY16			(0x1u<<16)
#define	MCE_MKEYR0_MKEY15			(0x1u<<15)
#define	MCE_MKEYR0_MKEY14			(0x1u<<14)
#define	MCE_MKEYR0_MKEY13			(0x1u<<13)
#define	MCE_MKEYR0_MKEY12			(0x1u<<12)
#define	MCE_MKEYR0_MKEY11			(0x1u<<11)
#define	MCE_MKEYR0_MKEY10			(0x1u<<10)
#define	MCE_MKEYR0_MKEY9			(0x1u<<9)
#define	MCE_MKEYR0_MKEY8			(0x1u<<8)
#define	MCE_MKEYR0_MKEY7			(0x1u<<7)
#define	MCE_MKEYR0_MKEY6			(0x1u<<6)
#define	MCE_MKEYR0_MKEY5			(0x1u<<5)
#define	MCE_MKEYR0_MKEY4			(0x1u<<4)
#define	MCE_MKEYR0_MKEY3			(0x1u<<3)
#define	MCE_MKEYR0_MKEY2			(0x1u<<2)
#define	MCE_MKEYR0_MKEY1			(0x1u<<1)
#define	MCE_MKEYR0_MKEY0			(0x1u<<0)

// MKEYR1 Configuration

#define	MCE_MKEYR1_MKEY63			(0x1u<<31)
#define	MCE_MKEYR1_MKEY62			(0x1u<<30)
#define	MCE_MKEYR1_MKEY61			(0x1u<<29)
#define	MCE_MKEYR1_MKEY60			(0x1u<<28)
#define	MCE_MKEYR1_MKEY59			(0x1u<<27)
#define	MCE_MKEYR1_MKEY58			(0x1u<<26)
#define	MCE_MKEYR1_MKEY57			(0x1u<<25)
#define	MCE_MKEYR1_MKEY56			(0x1u<<24)
#define	MCE_MKEYR1_MKEY55			(0x1u<<23)
#define	MCE_MKEYR1_MKEY54			(0x1u<<22)
#define	MCE_MKEYR1_MKEY53			(0x1u<<21)
#define	MCE_MKEYR1_MKEY52			(0x1u<<20)
#define	MCE_MKEYR1_MKEY51			(0x1u<<19)
#define	MCE_MKEYR1_MKEY50			(0x1u<<18)
#define	MCE_MKEYR1_MKEY49			(0x1u<<17)
#define	MCE_MKEYR1_MKEY48			(0x1u<<16)
#define	MCE_MKEYR1_MKEY47			(0x1u<<15)
#define	MCE_MKEYR1_MKEY46			(0x1u<<14)
#define	MCE_MKEYR1_MKEY45			(0x1u<<13)
#define	MCE_MKEYR1_MKEY44			(0x1u<<12)
#define	MCE_MKEYR1_MKEY43			(0x1u<<11)
#define	MCE_MKEYR1_MKEY42			(0x1u<<10)
#define	MCE_MKEYR1_MKEY41			(0x1u<<9)
#define	MCE_MKEYR1_MKEY40			(0x1u<<8)
#define	MCE_MKEYR1_MKEY39			(0x1u<<7)
#define	MCE_MKEYR1_MKEY38			(0x1u<<6)
#define	MCE_MKEYR1_MKEY37			(0x1u<<5)
#define	MCE_MKEYR1_MKEY36			(0x1u<<4)
#define	MCE_MKEYR1_MKEY35			(0x1u<<3)
#define	MCE_MKEYR1_MKEY34			(0x1u<<2)
#define	MCE_MKEYR1_MKEY33			(0x1u<<1)
#define	MCE_MKEYR1_MKEY32			(0x1u<<0)

// MKEYR2 Configuration

#define	MCE_MKEYR2_MKEY95			(0x1u<<31)
#define	MCE_MKEYR2_MKEY94			(0x1u<<30)
#define	MCE_MKEYR2_MKEY93			(0x1u<<29)
#define	MCE_MKEYR2_MKEY92			(0x1u<<28)
#define	MCE_MKEYR2_MKEY91			(0x1u<<27)
#define	MCE_MKEYR2_MKEY90			(0x1u<<26)
#define	MCE_MKEYR2_MKEY89			(0x1u<<25)
#define	MCE_MKEYR2_MKEY88			(0x1u<<24)
#define	MCE_MKEYR2_MKEY87			(0x1u<<23)
#define	MCE_MKEYR2_MKEY86			(0x1u<<22)
#define	MCE_MKEYR2_MKEY85			(0x1u<<21)
#define	MCE_MKEYR2_MKEY84			(0x1u<<20)
#define	MCE_MKEYR2_MKEY83			(0x1u<<19)
#define	MCE_MKEYR2_MKEY82			(0x1u<<18)
#define	MCE_MKEYR2_MKEY81			(0x1u<<17)
#define	MCE_MKEYR2_MKEY80			(0x1u<<16)
#define	MCE_MKEYR2_MKEY79			(0x1u<<15)
#define	MCE_MKEYR2_MKEY78			(0x1u<<14)
#define	MCE_MKEYR2_MKEY77			(0x1u<<13)
#define	MCE_MKEYR2_MKEY76			(0x1u<<12)
#define	MCE_MKEYR2_MKEY75			(0x1u<<11)
#define	MCE_MKEYR2_MKEY74			(0x1u<<10)
#define	MCE_MKEYR2_MKEY73			(0x1u<<9)
#define	MCE_MKEYR2_MKEY72			(0x1u<<8)
#define	MCE_MKEYR2_MKEY71			(0x1u<<7)
#define	MCE_MKEYR2_MKEY70			(0x1u<<6)
#define	MCE_MKEYR2_MKEY69			(0x1u<<5)
#define	MCE_MKEYR2_MKEY68			(0x1u<<4)
#define	MCE_MKEYR2_MKEY67			(0x1u<<3)
#define	MCE_MKEYR2_MKEY66			(0x1u<<2)
#define	MCE_MKEYR2_MKEY65			(0x1u<<1)
#define	MCE_MKEYR2_MKEY64			(0x1u<<0)

