hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_mce.h
// MKEYR3 Configuration

#define	MCE_MKEYR3_MKEY127			(0x1u<<31)
#define	MCE_MKEYR3_MKEY126			(0x1u<<30)
#define	MCE_MKEYR3_MKEY125			(0x1u<<29)
#define	MCE_MKEYR3_MKEY124			(0x1u<<28)
#define	MCE_MKEYR3_MKEY123			(0x1u<<27)
#define	MCE_MKEYR3_MKEY122			(0x1u<<26)
#define	MCE_MKEYR3_MKEY121			(0x1u<<25)
#define	MCE_MKEYR3_MKEY120			(0x1u<<24)
#define	MCE_MKEYR3_MKEY119			(0x1u<<23)
#define	MCE_MKEYR3_MKEY118			(0x1u<<22)
#define	MCE_MKEYR3_MKEY117			(0x1u<<21)
#define	MCE_MKEYR3_MKEY116			(0x1u<<20)
#define	MCE_MKEYR3_MKEY115			(0x1u<<19)
#define	MCE_MKEYR3_MKEY114			(0x1u<<18)
#define	MCE_MKEYR3_MKEY113			(0x1u<<17)
#define	MCE_MKEYR3_MKEY112			(0x1u<<16)
#define	MCE_MKEYR3_MKEY111			(0x1u<<15)
#define	MCE_MKEYR3_MKEY110			(0x1u<<14)
#define	MCE_MKEYR3_MKEY109			(0x1u<<13)
#define	MCE_MKEYR3_MKEY108			(0x1u<<12)
#define	MCE_MKEYR3_MKEY107			(0x1u<<11)
#define	MCE_MKEYR3_MKEY106			(0x1u<<10)
#define	MCE_MKEYR3_MKEY105			(0x1u<<9)
#define	MCE_MKEYR3_MKEY104			(0x1u<<8)
#define	MCE_MKEYR3_MKEY103			(0x1u<<7)
#define	MCE_MKEYR3_MKEY102			(0x1u<<6)
#define	MCE_MKEYR3_MKEY101			(0x1u<<5)
#define	MCE_MKEYR3_MKEY100			(0x1u<<4)
#define	MCE_MKEYR3_MKEY99			(0x1u<<3)
#define	MCE_MKEYR3_MKEY98			(0x1u<<2)
#define	MCE_MKEYR3_MKEY97			(0x1u<<1)
#define	MCE_MKEYR3_MKEY96			(0x1u<<0)

// MKEYR4 Configuration

#define	MCE_MKEYR4_MKEY159			(0x1u<<31)
#define	MCE_MKEYR4_MKEY158			(0x1u<<30)
#define	MCE_MKEYR4_MKEY157			(0x1u<<29)
#define	MCE_MKEYR4_MKEY156			(0x1u<<28)
#define	MCE_MKEYR4_MKEY155			(0x1u<<27)
#define	MCE_MKEYR4_MKEY154			(0x1u<<26)
#define	MCE_MKEYR4_MKEY153			(0x1u<<25)
#define	MCE_MKEYR4_MKEY152			(0x1u<<24)
#define	MCE_MKEYR4_MKEY151			(0x1u<<23)
#define	MCE_MKEYR4_MKEY150			(0x1u<<22)
#define	MCE_MKEYR4_MKEY149			(0x1u<<21)
#define	MCE_MKEYR4_MKEY148			(0x1u<<20)
#define	MCE_MKEYR4_MKEY147			(0x1u<<19)
#define	MCE_MKEYR4_MKEY146			(0x1u<<18)
#define	MCE_MKEYR4_MKEY145			(0x1u<<17)
#define	MCE_MKEYR4_MKEY144			(0x1u<<16)
#define	MCE_MKEYR4_MKEY143			(0x1u<<15)
#define	MCE_MKEYR4_MKEY142			(0x1u<<14)
#define	MCE_MKEYR4_MKEY141			(0x1u<<13)
#define	MCE_MKEYR4_MKEY140			(0x1u<<12)
#define	MCE_MKEYR4_MKEY139			(0x1u<<11)
#define	MCE_MKEYR4_MKEY138			(0x1u<<10)
#define	MCE_MKEYR4_MKEY137			(0x1u<<9)
#define	MCE_MKEYR4_MKEY136			(0x1u<<8)
#define	MCE_MKEYR4_MKEY135			(0x1u<<7)
#define	MCE_MKEYR4_MKEY134			(0x1u<<6)
#define	MCE_MKEYR4_MKEY133			(0x1u<<5)
#define	MCE_MKEYR4_MKEY132			(0x1u<<4)
#define	MCE_MKEYR4_MKEY131			(0x1u<<3)
#define	MCE_MKEYR4_MKEY130			(0x1u<<2)
#define	MCE_MKEYR4_MKEY129			(0x1u<<1)
#define	MCE_MKEYR4_MKEY128			(0x1u<<0)

// MKEYR5 Configuration

#define	MCE_MKEYR5_MKEY191			(0x1u<<31)
#define	MCE_MKEYR5_MKEY190			(0x1u<<30)
#define	MCE_MKEYR5_MKEY189			(0x1u<<29)
#define	MCE_MKEYR5_MKEY188			(0x1u<<28)
#define	MCE_MKEYR5_MKEY187			(0x1u<<27)
#define	MCE_MKEYR5_MKEY186			(0x1u<<26)
#define	MCE_MKEYR5_MKEY185			(0x1u<<25)
#define	MCE_MKEYR5_MKEY184			(0x1u<<24)
#define	MCE_MKEYR5_MKEY183			(0x1u<<23)
#define	MCE_MKEYR5_MKEY182			(0x1u<<22)
#define	MCE_MKEYR5_MKEY181			(0x1u<<21)
#define	MCE_MKEYR5_MKEY180			(0x1u<<20)
#define	MCE_MKEYR5_MKEY179			(0x1u<<19)
#define	MCE_MKEYR5_MKEY178			(0x1u<<18)
#define	MCE_MKEYR5_MKEY177			(0x1u<<17)
#define	MCE_MKEYR5_MKEY176			(0x1u<<16)
#define	MCE_MKEYR5_MKEY175			(0x1u<<15)
#define	MCE_MKEYR5_MKEY174			(0x1u<<14)
#define	MCE_MKEYR5_MKEY173			(0x1u<<13)
#define	MCE_MKEYR5_MKEY172			(0x1u<<12)
#define	MCE_MKEYR5_MKEY171			(0x1u<<11)
#define	MCE_MKEYR5_MKEY170			(0x1u<<10)
#define	MCE_MKEYR5_MKEY169			(0x1u<<9)
#define	MCE_MKEYR5_MKEY168			(0x1u<<8)
#define	MCE_MKEYR5_MKEY167			(0x1u<<7)
#define	MCE_MKEYR5_MKEY166			(0x1u<<6)
#define	MCE_MKEYR5_MKEY165			(0x1u<<5)
#define	MCE_MKEYR5_MKEY164			(0x1u<<4)
#define	MCE_MKEYR5_MKEY163			(0x1u<<3)
#define	MCE_MKEYR5_MKEY162			(0x1u<<2)
#define	MCE_MKEYR5_MKEY161			(0x1u<<1)
#define	MCE_MKEYR5_MKEY160			(0x1u<<0)

// MKEYR6 Configuration

#define	MCE_MKEYR6_MKEY223			(0x1u<<31)
#define	MCE_MKEYR6_MKEY222			(0x1u<<30)
#define	MCE_MKEYR6_MKEY221			(0x1u<<29)
#define	MCE_MKEYR6_MKEY220			(0x1u<<28)
#define	MCE_MKEYR6_MKEY219			(0x1u<<27)
#define	MCE_MKEYR6_MKEY218			(0x1u<<26)
#define	MCE_MKEYR6_MKEY217			(0x1u<<25)
#define	MCE_MKEYR6_MKEY216			(0x1u<<24)
#define	MCE_MKEYR6_MKEY215			(0x1u<<23)
#define	MCE_MKEYR6_MKEY214			(0x1u<<22)
#define	MCE_MKEYR6_MKEY213			(0x1u<<21)
#define	MCE_MKEYR6_MKEY212			(0x1u<<20)
#define	MCE_MKEYR6_MKEY211			(0x1u<<19)
#define	MCE_MKEYR6_MKEY210			(0x1u<<18)
#define	MCE_MKEYR6_MKEY209			(0x1u<<17)
#define	MCE_MKEYR6_MKEY208			(0x1u<<16)
#define	MCE_MKEYR6_MKEY207			(0x1u<<15)
#define	MCE_MKEYR6_MKEY206			(0x1u<<14)
#define	MCE_MKEYR6_MKEY205			(0x1u<<13)
#define	MCE_MKEYR6_MKEY204			(0x1u<<12)
#define	MCE_MKEYR6_MKEY203			(0x1u<<11)
#define	MCE_MKEYR6_MKEY202			(0x1u<<10)
#define	MCE_MKEYR6_MKEY201			(0x1u<<9)
#define	MCE_MKEYR6_MKEY200			(0x1u<<8)
#define	MCE_MKEYR6_MKEY199			(0x1u<<7)
#define	MCE_MKEYR6_MKEY198			(0x1u<<6)
#define	MCE_MKEYR6_MKEY197			(0x1u<<5)
#define	MCE_MKEYR6_MKEY196			(0x1u<<4)
#define	MCE_MKEYR6_MKEY195			(0x1u<<3)
#define	MCE_MKEYR6_MKEY194			(0x1u<<2)
#define	MCE_MKEYR6_MKEY193			(0x1u<<1)
#define	MCE_MKEYR6_MKEY192			(0x1u<<0)

// MKEYR7 Configuration

#define	MCE_MKEYR7_MKEY255			(0x1u<<31)
#define	MCE_MKEYR7_MKEY254			(0x1u<<30)
#define	MCE_MKEYR7_MKEY253			(0x1u<<29)
#define	MCE_MKEYR7_MKEY252			(0x1u<<28)
#define	MCE_MKEYR7_MKEY251			(0x1u<<27)
#define	MCE_MKEYR7_MKEY250			(0x1u<<26)
#define	MCE_MKEYR7_MKEY249			(0x1u<<25)
#define	MCE_MKEYR7_MKEY248			(0x1u<<24)
#define	MCE_MKEYR7_MKEY247			(0x1u<<23)
#define	MCE_MKEYR7_MKEY246			(0x1u<<22)
#define	MCE_MKEYR7_MKEY245			(0x1u<<21)
#define	MCE_MKEYR7_MKEY244			(0x1u<<20)
#define	MCE_MKEYR7_MKEY243			(0x1u<<19)
#define	MCE_MKEYR7_MKEY242			(0x1u<<18)
#define	MCE_MKEYR7_MKEY241			(0x1u<<17)
#define	MCE_MKEYR7_MKEY240			(0x1u<<16)
#define	MCE_MKEYR7_MKEY239			(0x1u<<15)
#define	MCE_MKEYR7_MKEY238			(0x1u<<14)
#define	MCE_MKEYR7_MKEY237			(0x1u<<13)
#define	MCE_MKEYR7_MKEY236			(0x1u<<12)
#define	MCE_MKEYR7_MKEY235			(0x1u<<11)
#define	MCE_MKEYR7_MKEY234			(0x1u<<10)
#define	MCE_MKEYR7_MKEY233			(0x1u<<9)
#define	MCE_MKEYR7_MKEY232			(0x1u<<8)
#define	MCE_MKEYR7_MKEY231			(0x1u<<7)
#define	MCE_MKEYR7_MKEY230			(0x1u<<6)
#define	MCE_MKEYR7_MKEY229			(0x1u<<5)
#define	MCE_MKEYR7_MKEY228			(0x1u<<4)
#define	MCE_MKEYR7_MKEY227			(0x1u<<3)
#define	MCE_MKEYR7_MKEY226			(0x1u<<2)
#define	MCE_MKEYR7_MKEY225			(0x1u<<1)
#define	MCE_MKEYR7_MKEY224			(0x1u<<0)

// FMKEYR0 Configuration

#define	MCE_FMKEYR0_FMKEY31			(0x1u<<31)
#define	MCE_FMKEYR0_FMKEY30			(0x1u<<30)
#define	MCE_FMKEYR0_FMKEY29			(0x1u<<29)
#define	MCE_FMKEYR0_FMKEY28			(0x1u<<28)
#define	MCE_FMKEYR0_FMKEY27			(0x1u<<27)
#define	MCE_FMKEYR0_FMKEY26			(0x1u<<26)
#define	MCE_FMKEYR0_FMKEY25			(0x1u<<25)
#define	MCE_FMKEYR0_FMKEY24			(0x1u<<24)
#define	MCE_FMKEYR0_FMKEY23			(0x1u<<23)
#define	MCE_FMKEYR0_FMKEY22			(0x1u<<22)
#define	MCE_FMKEYR0_FMKEY21			(0x1u<<21)
#define	MCE_FMKEYR0_FMKEY20			(0x1u<<20)
#define	MCE_FMKEYR0_FMKEY19			(0x1u<<19)
#define	MCE_FMKEYR0_FMKEY18			(0x1u<<18)
#define	MCE_FMKEYR0_FMKEY17			(0x1u<<17)
#define	MCE_FMKEYR0_FMKEY16			(0x1u<<16)
#define	MCE_FMKEYR0_FMKEY15			(0x1u<<15)
#define	MCE_FMKEYR0_FMKEY14			(0x1u<<14)
#define	MCE_FMKEYR0_FMKEY13			(0x1u<<13)
#define	MCE_FMKEYR0_FMKEY12			(0x1u<<12)
#define	MCE_FMKEYR0_FMKEY11			(0x1u<<11)
#define	MCE_FMKEYR0_FMKEY10			(0x1u<<10)
#define	MCE_FMKEYR0_FMKEY9			(0x1u<<9)
#define	MCE_FMKEYR0_FMKEY8			(0x1u<<8)
#define	MCE_FMKEYR0_FMKEY7			(0x1u<<7)
#define	MCE_FMKEYR0_FMKEY6			(0x1u<<6)
#define	MCE_FMKEYR0_FMKEY5			(0x1u<<5)
#define	MCE_FMKEYR0_FMKEY4			(0x1u<<4)
#define	MCE_FMKEYR0_FMKEY3			(0x1u<<3)
#define	MCE_FMKEYR0_FMKEY2			(0x1u<<2)
#define	MCE_FMKEYR0_FMKEY1			(0x1u<<1)
#define	MCE_FMKEYR0_FMKEY0			(0x1u<<0)

// FMKEYR1 Configuration

