hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_mce.h
#define	MCE_FMKEYR1_FMKEY63			(0x1u<<31)
#define	MCE_FMKEYR1_FMKEY62			(0x1u<<30)
#define	MCE_FMKEYR1_FMKEY61			(0x1u<<29)
#define	MCE_FMKEYR1_FMKEY60			(0x1u<<28)
#define	MCE_FMKEYR1_FMKEY59			(0x1u<<27)
#define	MCE_FMKEYR1_FMKEY58			(0x1u<<26)
#define	MCE_FMKEYR1_FMKEY57			(0x1u<<25)
#define	MCE_FMKEYR1_FMKEY56			(0x1u<<24)
#define	MCE_FMKEYR1_FMKEY55			(0x1u<<23)
#define	MCE_FMKEYR1_FMKEY54			(0x1u<<22)
#define	MCE_FMKEYR1_FMKEY53			(0x1u<<21)
#define	MCE_FMKEYR1_FMKEY52			(0x1u<<20)
#define	MCE_FMKEYR1_FMKEY51			(0x1u<<19)
#define	MCE_FMKEYR1_FMKEY50			(0x1u<<18)
#define	MCE_FMKEYR1_FMKEY49			(0x1u<<17)
#define	MCE_FMKEYR1_FMKEY48			(0x1u<<16)
#define	MCE_FMKEYR1_FMKEY47			(0x1u<<15)
#define	MCE_FMKEYR1_FMKEY46			(0x1u<<14)
#define	MCE_FMKEYR1_FMKEY45			(0x1u<<13)
#define	MCE_FMKEYR1_FMKEY44			(0x1u<<12)
#define	MCE_FMKEYR1_FMKEY43			(0x1u<<11)
#define	MCE_FMKEYR1_FMKEY42			(0x1u<<10)
#define	MCE_FMKEYR1_FMKEY41			(0x1u<<9)
#define	MCE_FMKEYR1_FMKEY40			(0x1u<<8)
#define	MCE_FMKEYR1_FMKEY39			(0x1u<<7)
#define	MCE_FMKEYR1_FMKEY38			(0x1u<<6)
#define	MCE_FMKEYR1_FMKEY37			(0x1u<<5)
#define	MCE_FMKEYR1_FMKEY36			(0x1u<<4)
#define	MCE_FMKEYR1_FMKEY35			(0x1u<<3)
#define	MCE_FMKEYR1_FMKEY34			(0x1u<<2)
#define	MCE_FMKEYR1_FMKEY33			(0x1u<<1)
#define	MCE_FMKEYR1_FMKEY32			(0x1u<<0)

// FMKEYR2 Configuration

#define	MCE_FMKEYR2_FMKEY95			(0x1u<<31)
#define	MCE_FMKEYR2_FMKEY94			(0x1u<<30)
#define	MCE_FMKEYR2_FMKEY93			(0x1u<<29)
#define	MCE_FMKEYR2_FMKEY92			(0x1u<<28)
#define	MCE_FMKEYR2_FMKEY91			(0x1u<<27)
#define	MCE_FMKEYR2_FMKEY90			(0x1u<<26)
#define	MCE_FMKEYR2_FMKEY89			(0x1u<<25)
#define	MCE_FMKEYR2_FMKEY88			(0x1u<<24)
#define	MCE_FMKEYR2_FMKEY87			(0x1u<<23)
#define	MCE_FMKEYR2_FMKEY86			(0x1u<<22)
#define	MCE_FMKEYR2_FMKEY85			(0x1u<<21)
#define	MCE_FMKEYR2_FMKEY84			(0x1u<<20)
#define	MCE_FMKEYR2_FMKEY83			(0x1u<<19)
#define	MCE_FMKEYR2_FMKEY82			(0x1u<<18)
#define	MCE_FMKEYR2_FMKEY81			(0x1u<<17)
#define	MCE_FMKEYR2_FMKEY80			(0x1u<<16)
#define	MCE_FMKEYR2_FMKEY79			(0x1u<<15)
#define	MCE_FMKEYR2_FMKEY78			(0x1u<<14)
#define	MCE_FMKEYR2_FMKEY77			(0x1u<<13)
#define	MCE_FMKEYR2_FMKEY76			(0x1u<<12)
#define	MCE_FMKEYR2_FMKEY75			(0x1u<<11)
#define	MCE_FMKEYR2_FMKEY74			(0x1u<<10)
#define	MCE_FMKEYR2_FMKEY73			(0x1u<<9)
#define	MCE_FMKEYR2_FMKEY72			(0x1u<<8)
#define	MCE_FMKEYR2_FMKEY71			(0x1u<<7)
#define	MCE_FMKEYR2_FMKEY70			(0x1u<<6)
#define	MCE_FMKEYR2_FMKEY69			(0x1u<<5)
#define	MCE_FMKEYR2_FMKEY68			(0x1u<<4)
#define	MCE_FMKEYR2_FMKEY67			(0x1u<<3)
#define	MCE_FMKEYR2_FMKEY66			(0x1u<<2)
#define	MCE_FMKEYR2_FMKEY65			(0x1u<<1)
#define	MCE_FMKEYR2_FMKEY64			(0x1u<<0)

// FMKEYR3 Configuration

#define	MCE_FMKEYR3_FMKEY127		(0x1u<<31)
#define	MCE_FMKEYR3_FMKEY126		(0x1u<<30)
#define	MCE_FMKEYR3_FMKEY125		(0x1u<<29)
#define	MCE_FMKEYR3_FMKEY124		(0x1u<<28)
#define	MCE_FMKEYR3_FMKEY123		(0x1u<<27)
#define	MCE_FMKEYR3_FMKEY122		(0x1u<<26)
#define	MCE_FMKEYR3_FMKEY121		(0x1u<<25)
#define	MCE_FMKEYR3_FMKEY120		(0x1u<<24)
#define	MCE_FMKEYR3_FMKEY119		(0x1u<<23)
#define	MCE_FMKEYR3_FMKEY118		(0x1u<<22)
#define	MCE_FMKEYR3_FMKEY117		(0x1u<<21)
#define	MCE_FMKEYR3_FMKEY116		(0x1u<<20)
#define	MCE_FMKEYR3_FMKEY115		(0x1u<<19)
#define	MCE_FMKEYR3_FMKEY114		(0x1u<<18)
#define	MCE_FMKEYR3_FMKEY113		(0x1u<<17)
#define	MCE_FMKEYR3_FMKEY112		(0x1u<<16)
#define	MCE_FMKEYR3_FMKEY111		(0x1u<<15)
#define	MCE_FMKEYR3_FMKEY110		(0x1u<<14)
#define	MCE_FMKEYR3_FMKEY109		(0x1u<<13)
#define	MCE_FMKEYR3_FMKEY108		(0x1u<<12)
#define	MCE_FMKEYR3_FMKEY107		(0x1u<<11)
#define	MCE_FMKEYR3_FMKEY106		(0x1u<<10)
#define	MCE_FMKEYR3_FMKEY105		(0x1u<<9)
#define	MCE_FMKEYR3_FMKEY104		(0x1u<<8)
#define	MCE_FMKEYR3_FMKEY103		(0x1u<<7)
#define	MCE_FMKEYR3_FMKEY102		(0x1u<<6)
#define	MCE_FMKEYR3_FMKEY101		(0x1u<<5)
#define	MCE_FMKEYR3_FMKEY100		(0x1u<<4)
#define	MCE_FMKEYR3_FMKEY99			(0x1u<<3)
#define	MCE_FMKEYR3_FMKEY98			(0x1u<<2)
#define	MCE_FMKEYR3_FMKEY97			(0x1u<<1)
#define	MCE_FMKEYR3_FMKEY96			(0x1u<<0)

// FMKEYR4 Configuration

#define	MCE_FMKEYR4_FMKEY159		(0x1u<<31)
#define	MCE_FMKEYR4_FMKEY158		(0x1u<<30)
#define	MCE_FMKEYR4_FMKEY157		(0x1u<<29)
#define	MCE_FMKEYR4_FMKEY156		(0x1u<<28)
#define	MCE_FMKEYR4_FMKEY155		(0x1u<<27)
#define	MCE_FMKEYR4_FMKEY154		(0x1u<<26)
#define	MCE_FMKEYR4_FMKEY153		(0x1u<<25)
#define	MCE_FMKEYR4_FMKEY152		(0x1u<<24)
#define	MCE_FMKEYR4_FMKEY151		(0x1u<<23)
#define	MCE_FMKEYR4_FMKEY150		(0x1u<<22)
#define	MCE_FMKEYR4_FMKEY149		(0x1u<<21)
#define	MCE_FMKEYR4_FMKEY148		(0x1u<<20)
#define	MCE_FMKEYR4_FMKEY147		(0x1u<<19)
#define	MCE_FMKEYR4_FMKEY146		(0x1u<<18)
#define	MCE_FMKEYR4_FMKEY145		(0x1u<<17)
#define	MCE_FMKEYR4_FMKEY144		(0x1u<<16)
#define	MCE_FMKEYR4_FMKEY143		(0x1u<<15)
#define	MCE_FMKEYR4_FMKEY142		(0x1u<<14)
#define	MCE_FMKEYR4_FMKEY141		(0x1u<<13)
#define	MCE_FMKEYR4_FMKEY140		(0x1u<<12)
#define	MCE_FMKEYR4_FMKEY139		(0x1u<<11)
#define	MCE_FMKEYR4_FMKEY138		(0x1u<<10)
#define	MCE_FMKEYR4_FMKEY137		(0x1u<<9)
#define	MCE_FMKEYR4_FMKEY136		(0x1u<<8)
#define	MCE_FMKEYR4_FMKEY135		(0x1u<<7)
#define	MCE_FMKEYR4_FMKEY134		(0x1u<<6)
#define	MCE_FMKEYR4_FMKEY133		(0x1u<<5)
#define	MCE_FMKEYR4_FMKEY132		(0x1u<<4)
#define	MCE_FMKEYR4_FMKEY131		(0x1u<<3)
#define	MCE_FMKEYR4_FMKEY130		(0x1u<<2)
#define	MCE_FMKEYR4_FMKEY129		(0x1u<<1)
#define	MCE_FMKEYR4_FMKEY128		(0x1u<<0)

// FMKEYR5 Configuration

#define	MCE_FMKEYR5_FMKEY191		(0x1u<<31)
#define	MCE_FMKEYR5_FMKEY190		(0x1u<<30)
#define	MCE_FMKEYR5_FMKEY189		(0x1u<<29)
#define	MCE_FMKEYR5_FMKEY188		(0x1u<<28)
#define	MCE_FMKEYR5_FMKEY187		(0x1u<<27)
#define	MCE_FMKEYR5_FMKEY186		(0x1u<<26)
#define	MCE_FMKEYR5_FMKEY185		(0x1u<<25)
#define	MCE_FMKEYR5_FMKEY184		(0x1u<<24)
#define	MCE_FMKEYR5_FMKEY183		(0x1u<<23)
#define	MCE_FMKEYR5_FMKEY182		(0x1u<<22)
#define	MCE_FMKEYR5_FMKEY181		(0x1u<<21)
#define	MCE_FMKEYR5_FMKEY180		(0x1u<<20)
#define	MCE_FMKEYR5_FMKEY179		(0x1u<<19)
#define	MCE_FMKEYR5_FMKEY178		(0x1u<<18)
#define	MCE_FMKEYR5_FMKEY177		(0x1u<<17)
#define	MCE_FMKEYR5_FMKEY176		(0x1u<<16)
#define	MCE_FMKEYR5_FMKEY175		(0x1u<<15)
#define	MCE_FMKEYR5_FMKEY174		(0x1u<<14)
#define	MCE_FMKEYR5_FMKEY173		(0x1u<<13)
#define	MCE_FMKEYR5_FMKEY172		(0x1u<<12)
#define	MCE_FMKEYR5_FMKEY171		(0x1u<<11)
#define	MCE_FMKEYR5_FMKEY170		(0x1u<<10)
#define	MCE_FMKEYR5_FMKEY169		(0x1u<<9)
#define	MCE_FMKEYR5_FMKEY168		(0x1u<<8)
#define	MCE_FMKEYR5_FMKEY167		(0x1u<<7)
#define	MCE_FMKEYR5_FMKEY166		(0x1u<<6)
#define	MCE_FMKEYR5_FMKEY165		(0x1u<<5)
#define	MCE_FMKEYR5_FMKEY164		(0x1u<<4)
#define	MCE_FMKEYR5_FMKEY163		(0x1u<<3)
#define	MCE_FMKEYR5_FMKEY162		(0x1u<<2)
#define	MCE_FMKEYR5_FMKEY161		(0x1u<<1)
#define	MCE_FMKEYR5_FMKEY160		(0x1u<<0)

// FMKEYR6 Configuration

