hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_mce.h
#define	MCE_FMKEYR6_FMKEY223		(0x1u<<31)
#define	MCE_FMKEYR6_FMKEY222		(0x1u<<30)
#define	MCE_FMKEYR6_FMKEY221		(0x1u<<29)
#define	MCE_FMKEYR6_FMKEY220		(0x1u<<28)
#define	MCE_FMKEYR6_FMKEY219		(0x1u<<27)
#define	MCE_FMKEYR6_FMKEY218		(0x1u<<26)
#define	MCE_FMKEYR6_FMKEY217		(0x1u<<25)
#define	MCE_FMKEYR6_FMKEY216		(0x1u<<24)
#define	MCE_FMKEYR6_FMKEY215		(0x1u<<23)
#define	MCE_FMKEYR6_FMKEY214		(0x1u<<22)
#define	MCE_FMKEYR6_FMKEY213		(0x1u<<21)
#define	MCE_FMKEYR6_FMKEY212		(0x1u<<20)
#define	MCE_FMKEYR6_FMKEY211		(0x1u<<19)
#define	MCE_FMKEYR6_FMKEY210		(0x1u<<18)
#define	MCE_FMKEYR6_FMKEY209		(0x1u<<17)
#define	MCE_FMKEYR6_FMKEY208		(0x1u<<16)
#define	MCE_FMKEYR6_FMKEY207		(0x1u<<15)
#define	MCE_FMKEYR6_FMKEY206		(0x1u<<14)
#define	MCE_FMKEYR6_FMKEY205		(0x1u<<13)
#define	MCE_FMKEYR6_FMKEY204		(0x1u<<12)
#define	MCE_FMKEYR6_FMKEY203		(0x1u<<11)
#define	MCE_FMKEYR6_FMKEY202		(0x1u<<10)
#define	MCE_FMKEYR6_FMKEY201		(0x1u<<9)
#define	MCE_FMKEYR6_FMKEY200		(0x1u<<8)
#define	MCE_FMKEYR6_FMKEY199		(0x1u<<7)
#define	MCE_FMKEYR6_FMKEY198		(0x1u<<6)
#define	MCE_FMKEYR6_FMKEY197		(0x1u<<5)
#define	MCE_FMKEYR6_FMKEY196		(0x1u<<4)
#define	MCE_FMKEYR6_FMKEY195		(0x1u<<3)
#define	MCE_FMKEYR6_FMKEY194		(0x1u<<2)
#define	MCE_FMKEYR6_FMKEY193		(0x1u<<1)
#define	MCE_FMKEYR6_FMKEY192		(0x1u<<0)

// FMKEYR7 Configuration

#define	MCE_FMKEYR7_FMKEY255		(0x1u<<31)
#define	MCE_FMKEYR7_FMKEY254		(0x1u<<30)
#define	MCE_FMKEYR7_FMKEY253		(0x1u<<29)
#define	MCE_FMKEYR7_FMKEY252		(0x1u<<28)
#define	MCE_FMKEYR7_FMKEY251		(0x1u<<27)
#define	MCE_FMKEYR7_FMKEY250		(0x1u<<26)
#define	MCE_FMKEYR7_FMKEY249		(0x1u<<25)
#define	MCE_FMKEYR7_FMKEY248		(0x1u<<24)
#define	MCE_FMKEYR7_FMKEY247		(0x1u<<23)
#define	MCE_FMKEYR7_FMKEY246		(0x1u<<22)
#define	MCE_FMKEYR7_FMKEY245		(0x1u<<21)
#define	MCE_FMKEYR7_FMKEY244		(0x1u<<20)
#define	MCE_FMKEYR7_FMKEY243		(0x1u<<19)
#define	MCE_FMKEYR7_FMKEY242		(0x1u<<18)
#define	MCE_FMKEYR7_FMKEY241		(0x1u<<17)
#define	MCE_FMKEYR7_FMKEY240		(0x1u<<16)
#define	MCE_FMKEYR7_FMKEY239		(0x1u<<15)
#define	MCE_FMKEYR7_FMKEY238		(0x1u<<14)
#define	MCE_FMKEYR7_FMKEY237		(0x1u<<13)
#define	MCE_FMKEYR7_FMKEY236		(0x1u<<12)
#define	MCE_FMKEYR7_FMKEY235		(0x1u<<11)
#define	MCE_FMKEYR7_FMKEY234		(0x1u<<10)
#define	MCE_FMKEYR7_FMKEY233		(0x1u<<9)
#define	MCE_FMKEYR7_FMKEY232		(0x1u<<8)
#define	MCE_FMKEYR7_FMKEY231		(0x1u<<7)
#define	MCE_FMKEYR7_FMKEY230		(0x1u<<6)
#define	MCE_FMKEYR7_FMKEY229		(0x1u<<5)
#define	MCE_FMKEYR7_FMKEY228		(0x1u<<4)
#define	MCE_FMKEYR7_FMKEY227		(0x1u<<3)
#define	MCE_FMKEYR7_FMKEY226		(0x1u<<2)
#define	MCE_FMKEYR7_FMKEY225		(0x1u<<1)
#define	MCE_FMKEYR7_FMKEY224		(0x1u<<0)

// CC1CFGR Configuration

#define	MCE_CC1CFGR_VERSION			(0xFFFFu<<16)
#define	MCE_CC1CFGR_VERSION_0		(0x1u<<16)
#define	MCE_CC1CFGR_KEYCRC			(0xFFu<<8)
#define	MCE_CC1CFGR_KEYCRC_0		(0x1u<<8)
#define	MCE_CC1CFGR_MODE			(0x3u<<4)
#define	MCE_CC1CFGR_MODE_0			(0x1u<<4)
#define	MCE_CC1CFGR_KEYLOCK			(0x1u<<2)
#define	MCE_CC1CFGR_CCLOCK			(0x1u<<1)
#define	MCE_CC1CFGR_CCEN			(0x1u<<0)

#define	MCE_CC1CFGR_MODE_B_0X2		(0x2u<<4)
#define	MCE_CC1CFGR_MODE_B_0X3		(0x3u<<4)
#define	MCE_CC1CFGR_KEYLOCK_B_0X0	(0x0u<<2)
#define	MCE_CC1CFGR_KEYLOCK_B_0X1	(0x1u<<2)
#define	MCE_CC1CFGR_CCLOCK_B_0X0	(0x0u<<1)
#define	MCE_CC1CFGR_CCLOCK_B_0X1	(0x1u<<1)
#define	MCE_CC1CFGR_CCEN_B_0X0		(0x0u<<0)
#define	MCE_CC1CFGR_CCEN_B_0X1		(0x1u<<0)

// CC1NR0 Configuration

#define	MCE_CC1NR0_SCNONCE			(0xFFFFFFFFu<<0)
#define	MCE_CC1NR0_SCNONCE_0		(0x1u<<0)

// CC1NR1 Configuration

#define	MCE_CC1NR1_SCNONCE			(0xFFFFFFFFu<<0)
#define	MCE_CC1NR1_SCNONCE_0		(0x1u<<0)

// CC1KEYR0 Configuration

#define	MCE_CC1KEYR0_KEY			(0xFFFFFFFFu<<0)
#define	MCE_CC1KEYR0_KEY_0			(0x1u<<0)

// CC1KEYR1 Configuration

#define	MCE_CC1KEYR1_KEY			(0xFFFFFFFFu<<0)
#define	MCE_CC1KEYR1_KEY_0			(0x1u<<0)

// CC1KEYR2 Configuration

#define	MCE_CC1KEYR2_KEY			(0xFFFFFFFFu<<0)
#define	MCE_CC1KEYR2_KEY_0			(0x1u<<0)

// CC1KEYR3 Configuration

#define	MCE_CC1KEYR3_KEY			(0xFFFFFFFFu<<0)
#define	MCE_CC1KEYR3_KEY_0			(0x1u<<0)

// CC2CFGR Configuration

#define	MCE_CC2CFGR_VERSION			(0xFFFFu<<16)
#define	MCE_CC2CFGR_VERSION_0		(0x1u<<16)
#define	MCE_CC2CFGR_KEYCRC			(0xFFu<<8)
#define	MCE_CC2CFGR_KEYCRC_0		(0x1u<<8)
#define	MCE_CC2CFGR_MODE			(0x3u<<4)
#define	MCE_CC2CFGR_MODE_0			(0x1u<<4)
#define	MCE_CC2CFGR_KEYLOCK			(0x1u<<2)
#define	MCE_CC2CFGR_CCLOCK			(0x1u<<1)
#define	MCE_CC2CFGR_CCEN			(0x1u<<0)

#define	MCE_CC2CFGR_MODE_B_0X2		(0x2u<<4)
#define	MCE_CC2CFGR_MODE_B_0X3		(0x3u<<4)
#define	MCE_CC2CFGR_KEYLOCK_B_0X0	(0x0u<<2)
#define	MCE_CC2CFGR_KEYLOCK_B_0X1	(0x1u<<2)
#define	MCE_CC2CFGR_CCLOCK_B_0X0	(0x0u<<1)
#define	MCE_CC2CFGR_CCLOCK_B_0X1	(0x1u<<1)
#define	MCE_CC2CFGR_CCEN_B_0X0		(0x0u<<0)
#define	MCE_CC2CFGR_CCEN_B_0X1		(0x1u<<0)

// CC2NR0 Configuration

#define	MCE_CC2NR0_SCNONCE			(0xFFFFFFFFu<<0)
#define	MCE_CC2NR0_SCNONCE_0		(0x1u<<0)

// CC2NR1 Configuration

#define	MCE_CC2NR1_SCNONCE			(0xFFFFFFFFu<<0)
#define	MCE_CC2NR1_SCNONCE_0		(0x1u<<0)

// CC2KEYR0 Configuration

#define	MCE_CC2KEYR0_KEY			(0xFFFFFFFFu<<0)
#define	MCE_CC2KEYR0_KEY_0			(0x1u<<0)

// CC2KEYR1 Configuration

#define	MCE_CC2KEYR1_KEY			(0xFFFFFFFFu<<0)
#define	MCE_CC2KEYR1_KEY_0			(0x1u<<0)

// CC2KEYR2 Configuration

#define	MCE_CC2KEYR2_KEY			(0xFFFFFFFFu<<0)
#define	MCE_CC2KEYR2_KEY_0			(0x1u<<0)

// CC2KEYR3 Configuration

#define	MCE_CC2KEYR3_KEY			(0xFFFFFFFFu<<0)
#define	MCE_CC2KEYR3_KEY_0			(0x1u<<0)
